---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalResourceServerExtensions
source: html/8bc5eab8-d445-c23f-696f-853248bedc46.htm
---
# ExternalResourceServerExtensions Properties

Specifies whether the .NET object represents a valid Revit entity.